# AULA 4

In [4]:
import pandas as pd

In [57]:
#Leitura dos arquivos
df1 = pd.read_excel("C:/Users/Fábio/Desktop/dio_analise_ dados_python_ pandas/datasets/Aracaju.xls")
df2 = pd.read_excel("C:/Users/Fábio/Desktop/dio_analise_ dados_python_ pandas/datasets/Fortaleza.xls")
df3 = pd.read_excel("C:/Users/Fábio/Desktop/dio_analise_ dados_python_ pandas/datasets/Natal.xls")
df4 = pd.read_excel("C:/Users/Fábio/Desktop/dio_analise_ dados_python_ pandas/datasets/Recife.xls")
df5 = pd.read_excel("C:/Users/Fábio/Desktop/dio_analise_ dados_python_ pandas/datasets/Salvador.xls")

In [12]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [13]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [14]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [15]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [16]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
98    Salvador 2019-01-01  231.76    1036     3
70       Natal 2019-02-14  743.00     854     4
135  Fortaleza 2019-03-02   10.79     983     5
120     Recife 2019-03-02  184.90     982     4
91       Natal 2019-01-02   17.74    1035     1

In [17]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [18]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [19]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [20]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [21]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [22]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [23]:
df["Vendas"].mean()

122.61180089485458

In [24]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [25]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
4       Recife 2019-02-14   19.89    983     7
18     Aracaju 2018-01-01   32.14   1522     6
223      Natal 2019-01-02   40.51   1037     2
0        Natal 2018-08-27  606.00    853     2
202   Salvador 2019-01-02   22.45   1036     1
211      Natal 2019-01-02  141.05   1035     3
7       Recife 2019-02-11   33.37    982     3
127  Fortaleza 2019-03-02   39.56    982     8
85     Aracaju 2018-01-01   15.17   1521     1
202      Natal 2019-01-02   22.45   1036     1
121     Recife 2019-03-02   41.55    981     3
141      Natal 2019-01-02    9.08   1036     1
238      Natal 2019-01-03  139.64   1035     1
37    Salvador 2019-01-01   18.31   1036     3
61    Salvador 2019-01-01    4.54   1036     3

In [26]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [27]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [28]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [29]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [30]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [31]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [32]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [33]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [34]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [35]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [36]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [37]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [38]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [39]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [40]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [41]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [43]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [44]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [45]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [46]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [47]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
161,Salvador,2019-01-02,5.8,1036,1,5.8,1.0,2019
224,Natal,2019-01-02,178.3,1035,3,534.9,3.0,2019
22,Natal,2018-06-21,621.0,853,3,1863.0,3.0,2018
58,Natal,2018-12-23,272.0,853,3,816.0,3.0,2018
113,Natal,2019-01-02,18.9,1034,3,56.7,3.0,2019

In [48]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [49]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
71,Salvador,2019-01-01,21.36,1035,2,42.72,2.0,2019,1,1
96,Fortaleza,2019-01-01,23.31,1004,4,93.24,4.0,2019,1,1
77,Salvador,2019-01-01,218.76,1037,1,218.76,1.0,2019,1,1
4,Natal,2019-03-09,699.00,853,3,2097.00,3.0,2019,3,9
49,Recife,2019-01-01,122.55,981,1,122.55,1.0,2019,1,1

In [50]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [51]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [52]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
84,Recife,2019-01-01,36.41,980,6,218.46,6.0,2019,1,1,365 days
87,Aracaju,2018-01-01,116.71,1520,4,466.84,4.0,2018,1,1,0 days
217,Natal,2019-01-02,37.65,1036,2,75.30,2.0,2019,1,2,366 days
69,Fortaleza,2019-01-01,216.65,1003,6,1299.90,6.0,2019,1,1,365 days
65,Fortaleza,2019-01-01,145.20,1005,2,290.40,2.0,2019,1,1,365 days

In [53]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [54]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
202,Natal,2019-01-02,22.45,1036,1,22.45,1.0,2019,1,2,366 days,1
40,Salvador,2019-02-13,161.87,1036,3,485.61,3.0,2019,2,13,408 days,1
188,Salvador,2019-01-02,178.11,1035,3,534.33,3.0,2019,1,2,366 days,1
152,Salvador,2019-01-02,20.07,1035,1,20.07,1.0,2019,1,2,366 days,1
31,Recife,2019-01-01,176.23,981,7,1233.61,7.0,2019,1,1,365 days,1

In [55]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [56]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
132,Salvador,2019-03-02,19.61,1036,2,39.22,2.0,2019,3,2,425 days,1
128,Recife,2019-03-02,38.70,982,4,154.80,4.0,2019,3,2,425 days,1
71,Natal,2019-03-20,840.00,854,3,2520.00,3.0,2019,3,20,443 days,1
110,Fortaleza,2019-03-02,51.98,983,6,311.88,6.0,2019,3,2,425 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2.0,2019,3,30,453 days,1
115,Fortaleza,2019-03-02,12.23,981,3,36.69,3.0,2019,3,2,425 days,1
7,Natal,2019-03-18,886.00,853,4,3544.00,4.0,2019,3,18,441 days,1
138,Recife,2019-03-02,150.38,983,6,902.28,6.0,2019,3,2,425 days,1
69,Natal,2019-03-24,817.00,852,4,3268.00,4.0,2019,3,24,447 days,1
141,Salvador,2019-03-02,9.08,1036,1,9.08,1.0,2019,3,2,425 days,1
119,Salvador,2019-03-02,136.37,1034,2,272.74,2.0,2019,3,2,425 days,1
113,Salvador,2019-03-02,18.90,1034,3,56.70,3.0,2019,3,2,425 days,1
18,Natal,2019-03-14,581.00,853,3,1743.00,3.0,2019,3,14,437 days,1
116,Recife,2019-03-02,79.10,982,2,158.20,2.0,2019,3,2,425 days,1
136,Fortaleza,2019-03-02,39.09,982,4,156.36,4.0,2019,3,2,425 days,1
109,Recife,2019-03-02,18.90,982,6,113.40,6.0,2019,3,2,425 days,1
120,Recife,2019-03-02,184.90,982,4,739.60,4.0,2019,3,2,425 days,1
8,Natal,2019-03-27,667.00,852,4,2668.00,4.0,2019,3,27,450 days,1
132,Fortaleza,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2,425 days,1
42,Natal,2019-03-02,775.00,854,2,1550.00,2.0,2019,3,2,425 days,1